In [3]:
import pandas as pd
import sqlite3

#read the CSV
df1 = pd.read_csv('insideairbnb/porto_06-2019_listings.csv')
df2 = pd.read_csv('insideairbnb/porto_06-2019_reviews.csv')
#connect to a database
conn = sqlite3.connect("Any_Database_Name.db") #if the db does not exist, this creates a Any_Database_Name.db file in the current directory
#store your table in the database:
df1.to_sql('listings', conn)
df2.to_sql('reviews', conn)
#read a SQL Query out of your database and into a pandas dataframe
sql_string = 'select  listing_id, host_id, min(date), listings.latitude, listings.longitude from reviews join listings on listings.id = reviews.listing_id where listings.neighbourhood_group_cleansed = "PORTO" group by listing_id order by date'
new_df = pd.read_sql(sql_string, conn)

new_df.head()

   listing_id  host_id   min(date)  latitude  longitude
0       91439   185209  2011-04-23  41.14833   -8.60983
1       86388   185209  2011-04-26  41.14847   -8.60812
2       94701   505473  2011-05-10  41.14707   -8.60109
3      131994   648963  2011-06-29  41.14993   -8.61510
4      100661   185209  2011-07-04  41.14851   -8.60988

In [25]:
new_df['concatenated'] = new_df['latitude'] + new_df['longitude']

new_df['concatenated'].value_counts()

32.54786    9
32.53318    8
32.53725    7
32.54648    7
32.53514    6
32.54378    6
32.54461    6
32.53408    6
32.53083    6
32.54209    6
32.54379    6
32.54500    6
32.54644    5
32.54264    5
32.54202    5
32.54602    5
32.53545    5
32.54387    5
32.52868    5
32.54803    5
32.54598    5
32.54616    5
32.53756    5
32.53228    5
32.54492    5
32.53962    5
32.54841    5
32.52981    5
32.54643    5
32.53308    5
           ..
32.52612    1
32.52969    1
32.55631    1
32.53137    1
32.53911    1
32.53883    1
32.54070    1
32.53977    1
32.55788    1
32.55321    1
32.53468    1
32.55240    1
32.59628    1
32.54547    1
32.54771    1
32.56521    1
32.51021    1
32.52492    1
32.55205    1
32.53952    1
32.50785    1
32.53000    1
32.52161    1
32.54750    1
32.55300    1
32.53752    1
32.47420    1
32.51279    1
32.54395    1
32.50000    1
Name: concatenated, Length: 4727, dtype: int64

In [16]:
new_df['bigOwner'] = new_df['host_id'].duplicated() 



new_df['bigOwner'].value_counts()

True     3754
False    3196
Name: bigOwner, dtype: int64

In [15]:
new_df.to_csv('mapdata.csv', encoding='utf-8')